  -- 0.000 seconds to run the select command. Read 1 pages
  -- 0.000 seconds to run the select command. Read 1 pages
  -- 0.000 seconds to run the select command. Read 6 pages
  -- 0.000 seconds to run the select command. Read 6 pages
  -- 0.010 seconds to run the select command. Read 13 pages
  -- 0.000 seconds to run the select command. Read 13 pages
  -- 0.020 seconds to run the select command. Read 113 pages
  -- 0.010 seconds to run the select command. Read 113 pages
  -- 0.010 seconds to run the select command. Read 113 pages
  -- 0.170 seconds to run the select command. Read 1366 pages
  -- 0.140 seconds to run the select command. Read 1366 pages
  -- 0.140 seconds to run the select command. Read 1366 pages
Bruinbase> Bruinbase> 8
Bruinbase> 272 'Baby Take a Bow'
2342 'Last Ride, The'
2244 'King Creole'
1578 'G.I. Blues'
Bruinbase> Bruinbase> Bruinbase> 50
Bruinbase> 272 'Baby Take a Bow'
489 'Blue Hawaii'
173 'Angel Levine, The'
175 'Angel Unchained'
303 'Bananas'
395 'Big Jake'
Bruinbase> Bruinbase> Bruinbase> 100
Bruinbase> 489 'Blue Hawaii'
Bruinbase> Bruinbase> Bruinbase> 1000
Bruinbase> 4589 'Wild Ride, The'
4583 'Wild Angels, The'
4515 'Wedding Party, The'
4657 'Wrecking Crew, The'
4570 'Who Is Harry Kellerman and Why Is He Saying Those Terrible Things About Me?'
4633 'Wizards of the Demon Sword'
4710 'By Way of the Stars'
4732 '¡Dispara!'
4579 'Widows Kiss'
4619 'Witch Hunt'
4733 'la folie'
4506 'Waterworld'
4524 'Welcome to the Dollhouse'
4531 'Wharf Rat, The'
4546 'When Night Is Falling'
4558 'While You Were Sleeping'
4560 'White Mans Burden'
4565 'White Wolves II: Legend of the Wild'
4581 'Wigstock: The Movie'
4584 'Wild Bill'
4601 'Windrunner'
4620 'Witchboard III: The Possession'
4621 'Witchcraft 7: Judgement Hour'
4637 'Wolves, The'
4660 'Wrong Woman, The'
4673 'Yao a yao yao dao waipo qiao'
4683 'Young Poisoners Handbook, The'
4700 'Zooman'
4727 'Sabrina, the Teenage Witch'
Bruinbase> 4589 'Wild Ride, The'
4583 'Wild Angels, The'
4515 'Wedding Party, The'
4657 'Wrecking Crew, The'
4570 'Who Is Harry Kellerman and Why Is He Saying Those Terrible Things About Me?'
4633 'Wizards of the Demon Sword'
4710 'By Way of the Stars'
4732 '¡Dispara!'
4579 'Widows Kiss'
4619 'Witch Hunt'
4733 'la folie'
4506 'Waterworld'
4524 'Welcome to the Dollhouse'
4531 'Wharf Rat, The'
4546 'When Night Is Falling'
4558 'While You Were Sleeping'
4560 'White Mans Burden'
4565 'White Wolves II: Legend of the Wild'
4581 'Wigstock: The Movie'
4584 'Wild Bill'
4601 'Windrunner'
4620 'Witchboard III: The Possession'
4621 'Witchcraft 7: Judgement Hour'
4637 'Wolves, The'
4660 'Wrong Woman, The'
4673 'Yao a yao yao dao waipo qiao'
4683 'Young Poisoners Handbook, The'
4700 'Zooman'
4727 'Sabrina, the Teenage Witch'
Bruinbase> Bruinbase> Bruinbase> 12278
Bruinbase> 4240 'Tommy Boy'
Bruinbase> 474 'Blood, Guts, Bullets and Octane'
439 'Black Sea 213'
486 'Blowback'
464 'Blondes Have More Guns'
459 'Blind Faith'
431 'Black Knight'
408 'Bikini Bistro'
471 'Blood of the Innocent'
467 'Blood and Wine'
443 'Blackjack'
490 'Blue Juice'
447 'Blacktop'
492 'Blue Ridge Fall'
479 'Bloodmoon'
427 'Black Day Blue Night'
458 'Blessed Art Thou'
410 'Bikini Hoe-Down'
445 'Blackout, The'
425 'Black Cat Run'
453 'Blast'
477 'Bloodhounds'
437 'Black Scorpion II: Aftershock'
489 'Blue Hawaii'
485 'Blow Dry'
493 'Blues Brothers 2000'
484 'Blow'
407 'Biker Zombies'
457 'Bless the Child'
420 'Bird of Prey'
463 'Blonde Heaven'
481 'Bloody Murder'
465 'Blood & Donuts'
433 'Black Out'
412 'Bikini Traffic School'
402 'Big Squeeze, The'
421 'Birdcage, The'
442 'Black Widow Escort'
472 'Blood Oranges, The'
405 'Bigfoot: The Unforgettable Encounter'
409 'Bikini Drive-In'
450 'Blade'
468 'Blood Money'
418 'Bio-Dome'
448 'Blackwater Trail'
444 'BlackMale'
430 'Black Hawk Down'
436 'Black Scorpion'
462 'Bliss'
496 'Bobby G. Cant Swim'
423 'BitterSweet'
440 'Black Sheep'
435 'Black Rose of Harlem'
454 'Blast from the Past'
480 'Bloodsport 2'
416 'Billys Hollywood Screen Kiss'
452 'Blair Witch Project, The'
413 'Billy Elliot'
491 'Blue Moon'
428 'Black Dog'
422 'Birthday Girl'
403 'Big Tease, The'
460 'Blind Heat'
424 'Black and White'
415 'Billys Holiday'
Bruinbase> Bruinbase> 